# Task 2 =================================================================================

# ТЗ: # Найти количество четных чисел в массиве.

# Developer notes: Испльзуйте for

# Входные данные:
# input_list = [1, 54, 23, 678, 23, 2322, 798, 34, 22, 1, 23, 54, 45, 67]
# ========================================================================================

def sort_even(input_list):
    count = 0
    for i in input_list:
        if i % 2 == 0:
            count += 1
    return count



print(f"In this list {sort_even([1, 54, 23, 678, 23, 2322, 798, 34, 22, 1, 23, 54, 45, 67])} even numbers")