# Task 4 =================================================================================

# ТЗ: Создать массив, каждый элемент которого равен квадрату своего номера.

# Developer notes: Испльзуйте range() и for

# Входные данные:
# длинна массива = 20
# ========================================================================================

list_geometric = [x**2 for x in range(21)]
# =========================
# отлично использован list comprehension.
# одно замечание: длинна массива тут не 20 а 21 ))
# =========================
print(list_geometric)
